src/main/test/supply-chain/0-Validation/0-Apply Tax/2-01_01_03_TaxCalculation_only/1-TC01.01.03.02_TaxCalculation_TDS_filled_Tax_values_partialfilled/1-TC01.01.03.02_TaxCalculation_TDS_filled_Tax_values_partialfilled_2/request.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:ws="http://ws.tim.ikea.com/">
   <soap:Header/>
   <soap:Body>
      <ws:applyTax>
        
    <arg0> <DocumentId>
               <SystemSourceId>FRIM001</SystemSourceId>
               <TransactionId>1000035415</TransactionId>
            </DocumentId>
            <AlternateDocumentId>
               <CustomField1>CustomField1</CustomField1>
               <CustomField2/>
               <CustomField3/>
               <CustomField4/>
               <CustomField5/>
               <CustomField6/>
               <CustomField7/>
               <CustomField8/>
               <CustomField9/>
               <CustomField10/>
            </AlternateDocumentId>
            <InvoiceLanguage>
               <LanguageCode>en</LanguageCode>
               <LanguageCountryCode>GB</LanguageCountryCode>
            </InvoiceLanguage>
            <CommunicationLanguage>
               <LanguageCode>en</LanguageCode>
               <LanguageCountryCode>GB</LanguageCountryCode>
            </CommunicationLanguage>
            <CalculationDecimalPlaces>0</CalculationDecimalPlaces>
            <PreviousInvoiceTaxCountry>ES</PreviousInvoiceTaxCountry>
            <TaxDecisionSet>
               <TaxDecisionSetId>1</TaxDecisionSetId>
               <SellerTaxIndicator>
                  <TaxIndicatorAbbreviation>MAT_EXPZ</TaxIndicatorAbbreviation>
                  <TaxIndicatorName>Export Zero %</TaxIndicatorName>
                  <TaxIndicatorComment>Export of goods</TaxIndicatorComment>
               </SellerTaxIndicator>
               <SellerTaxCountry>ES</SellerTaxCountry>
               <SellerTaxState>NULL</SellerTaxState>
               <BuyerTaxIndicator>
                  <TaxIndicatorAbbreviation>MAT_ZERO</TaxIndicatorAbbreviation>
                  <TaxIndicatorName>Zero%</TaxIndicatorName>
                  <TaxIndicatorComment>VAT zero-rated supply of goods</TaxIndicatorComment>
               </BuyerTaxIndicator>
               <BuyerTaxCountry>DE</BuyerTaxCountry>
               <BuyerTaxState>NULL</BuyerTaxState>
               <CombinedTaxIndicator>EXPZ</CombinedTaxIndicator>
               <CommercialIndicator>F</CommercialIndicator>
               <SellerTaxRegCountry>ES</SellerTaxRegCountry>
               <SellerTaxRegState>NULL</SellerTaxRegState>
               <BuyerTaxRegCountry>DE</BuyerTaxRegCountry>
               <BuyerTaxRegState>NULL</BuyerTaxRegState>
               <SellerTaxTotal>
                  <NetAmount>10.00</NetAmount>
                  <TaxAmount>1.00</TaxAmount>
                  <GrossAmount>11.00</GrossAmount>
                  <TaxAmountInLocalCurrency>0</TaxAmountInLocalCurrency>
                  <TaxInvoiceSubTotal>
                     <TaxType>
                        <TaxTypeName>DV</TaxTypeName>
                        <TaxTypeAbbreviation>VAT</TaxTypeAbbreviation>
                        <TaxTypeDescription>VALUE ADDED TAX</TaxTypeDescription>
                     </TaxType>
                     <TaxCode>1</TaxCode>
                     <TaxRate>10.0</TaxRate>
                     <NetAmount>10.00</NetAmount>
                     <TaxAmount>1.00</TaxAmount>
                     <GrossAmount>11.00</GrossAmount>
                     <TaxAmountInLocalCurrency>0</TaxAmountInLocalCurrency>
                  </TaxInvoiceSubTotal>
               </SellerTaxTotal>
               <BuyerTaxTotal/>
                 
               <TaxComment>
                  <TaxCommentType/>
                  <TaxCommentText/>
               </TaxComment>
               <InvoiceCurrency>
                  <CurrencyCode>EUR</CurrencyCode>
                  <SellerLocalTaxCurrencyCode/>
                  <BuyerLocalTaxCurrencyCode/>
               </InvoiceCurrency>
               <LegalTaxCalculationLevel>G</LegalTaxCalculationLevel>
               <TaxInvoiceLine>
                  <LineNumber>2</LineNumber>
                  <ItemNo>2</ItemNo>
                  <ItemType/>
                  <UNSPSC>80000000</UNSPSC>
                  <Classification>S</Classification>
                  <SubClassification>STORAGE</SubClassification>
                  <CountryItemClassification/>
                  <NetAmount>10.0</NetAmount>
                  <SellerTax/>
                     
                  <VariableTaxSteeringInput>
                     <ConsignorCountry/>
                     <ConsignorState/>
                     <ConsignorBusinessUnitCode/>
                     <ConsignorBusinessUnitType/>
                     <ConsigneeCountry/>
                     <ConsigneeState/>
                     <ConsigneeBusinessUnitCode/>
                     <ConsigneeBusinessUnitType/>
                     <CarrierCountry/>
                     <CarrierState/>
                     <CarrierBusinessUnitCode/>
                     <CarrierBusinessUnitType/>
                     <ShipmentStartCountry/>
                     <ShipmentEndCountry/>
                     <ShipmentStartState/>
                     <ShipmentEndState/>
                     <ServiceRenderedCountry/>
                     <ServiceRenderedState/>
                     <ResalePurpose/>
                     <IsOutBonded/>
                     <IsInBonded/>
                     <TaxPreAlgorithmOutput>
                        <IsExport/>
                        <IsImport/>
                        <IsExported/>
                        <IsImported/>
                     </TaxPreAlgorithmOutput>
                     <ShippingOfCustomsClearedGoods/>
                  </VariableTaxSteeringInput>
                  <BuyerTax/>
                     
               </TaxInvoiceLine>
               <SellerTaxInformation>
                  <TaxRegistration>
                     <TaxRegistrationCountry>ES</TaxRegistrationCountry>
                     <TaxRegistrationNumberType>DV</TaxRegistrationNumberType>
                     <TaxRegistrationNumber>ES A35474832</TaxRegistrationNumber>
                  </TaxRegistration>
                  <TaxRepresentative/>
               </SellerTaxInformation>
               <BuyerTaxInformation>
                  <TaxRegistration>
                     <TaxRegistrationCountry>DE</TaxRegistrationCountry>
                     <TaxRegistrationNumberType>DV</TaxRegistrationNumberType>
                     <TaxRegistrationNumber>DE813201883</TaxRegistrationNumber>
                  </TaxRegistration>
                  <TaxRepresentative/>
               </BuyerTaxInformation>
            </TaxDecisionSet>
            <TaxDecisionSet>
               <TaxDecisionSetId>2</TaxDecisionSetId>
               <SellerTaxIndicator>
                  <TaxIndicatorAbbreviation>MAT_EXPZ</TaxIndicatorAbbreviation>
                  <TaxIndicatorName>Export Zero %</TaxIndicatorName>
                  <TaxIndicatorComment>Export of goods</TaxIndicatorComment>
               </SellerTaxIndicator>
               <SellerTaxCountry>ES</SellerTaxCountry>
               <SellerTaxState>NULL</SellerTaxState>
               <BuyerTaxIndicator>
                  <TaxIndicatorAbbreviation>MAT_ZERO</TaxIndicatorAbbreviation>
                  <TaxIndicatorName>Zero%</TaxIndicatorName>
                  <TaxIndicatorComment>VAT zero-rated supply of goods</TaxIndicatorComment>
               </BuyerTaxIndicator>
               <BuyerTaxCountry>DE</BuyerTaxCountry>
               <BuyerTaxState>NULL</BuyerTaxState>
               <CombinedTaxIndicator>EXPZ</CombinedTaxIndicator>
               <CommercialIndicator>F</CommercialIndicator>
               <SellerTaxRegCountry>ES</SellerTaxRegCountry>
               <SellerTaxRegState>NULL</SellerTaxRegState>
               <BuyerTaxRegCountry>DE</BuyerTaxRegCountry>
               <BuyerTaxRegState>NULL</BuyerTaxRegState>
               <SellerTaxTotal>
                  <NetAmount>10.00</NetAmount>
                  <TaxAmount>0.80</TaxAmount>
                  <GrossAmount>10.80</GrossAmount>
                  <TaxAmountInLocalCurrency>0</TaxAmountInLocalCurrency>
                  <TaxInvoiceSubTotal>
                     <TaxType>
                        <TaxTypeName>DV</TaxTypeName>
                        <TaxTypeAbbreviation>VAT</TaxTypeAbbreviation>
                        <TaxTypeDescription>VALUE ADDED TAX</TaxTypeDescription>
                     </TaxType>
                     <TaxCode>0</TaxCode>
                     <TaxRate>8.0</TaxRate>
                     <NetAmount>10.00</NetAmount>
                     <TaxAmount>0.80</TaxAmount>
                     <GrossAmount>10.80</GrossAmount>
                     <TaxAmountInLocalCurrency>0</TaxAmountInLocalCurrency>
                  </TaxInvoiceSubTotal>
               </SellerTaxTotal>
               <BuyerTaxTotal/>
                  
               <TaxComment>
                  <TaxCommentType/>
                  <TaxCommentText/>
               </TaxComment>
               <InvoiceCurrency>
                  <CurrencyCode>EUR</CurrencyCode>
                  <SellerLocalTaxCurrencyCode/>
                  <BuyerLocalTaxCurrencyCode/>
               </InvoiceCurrency>
               <LegalTaxCalculationLevel>G</LegalTaxCalculationLevel>
               <TaxInvoiceLine>
                  <LineNumber>1</LineNumber>
                  <ItemNo>1</ItemNo>
                  <ItemType/>
                  <UNSPSC>90000000</UNSPSC>
                  <Classification>S</Classification>
                  <SubClassification>HANDLING</SubClassification>
                  <CountryItemClassification/>
                  <NetAmount>10.0</NetAmount>
                  <SellerTax/>
                     
                  <VariableTaxSteeringInput>
                     <ConsignorCountry/>
                     <ConsignorState/>
                     <ConsignorBusinessUnitCode/>
                     <ConsignorBusinessUnitType/>
                     <ConsigneeCountry/>
                     <ConsigneeState/>
                     <ConsigneeBusinessUnitCode/>
                     <ConsigneeBusinessUnitType/>
                     <CarrierCountry/>
                     <CarrierState/>
                     <CarrierBusinessUnitCode/>
                     <CarrierBusinessUnitType/>
                     <ShipmentStartCountry/>
                     <ShipmentEndCountry/>
                     <ShipmentStartState/>
                     <ShipmentEndState/>
                     <ServiceRenderedCountry/>
                     <ServiceRenderedState/>
                     <ResalePurpose/>
                     <IsOutBonded/>
                     <IsInBonded/>
                     <TaxPreAlgorithmOutput>
                        <IsExport/>
                        <IsImport/>
                        <IsExported/>
                        <IsImported/>
                     </TaxPreAlgorithmOutput>
                     <ShippingOfCustomsClearedGoods/>
                  </VariableTaxSteeringInput>
                  <BuyerTax/>
                     
               </TaxInvoiceLine>
               <SellerTaxInformation>
                  <TaxRegistration>
                     <TaxRegistrationCountry>ES</TaxRegistrationCountry>
                     <TaxRegistrationNumberType>DV</TaxRegistrationNumberType>
                     <TaxRegistrationNumber>ES A35474832</TaxRegistrationNumber>
                  </TaxRegistration>
                  <TaxRepresentative/>
               </SellerTaxInformation>
               <BuyerTaxInformation>
                  <TaxRegistration>
                     <TaxRegistrationCountry>DE</TaxRegistrationCountry>
                     <TaxRegistrationNumberType>DV</TaxRegistrationNumberType>
                     <TaxRegistrationNumber>DE813201883</TaxRegistrationNumber>
                  </TaxRegistration>
                  <TaxRepresentative/>
               </BuyerTaxInformation>
            </TaxDecisionSet>
            <TaxDate>
               <TaxAlgorithmDate>2014-01-11</TaxAlgorithmDate>
            </TaxDate>
            <TaxModuleBehaviour>
               <SkipCalculation>N</SkipCalculation>
               <SkipDecision>Y</SkipDecision>
            </TaxModuleBehaviour>
            <VariableTaxSteeringInput>
               <ConsignorCountry>ES</ConsignorCountry>
               <ConsignorState>ESTF</ConsignorState>
               <ConsignorBusinessUnitCode>7008</ConsignorBusinessUnitCode>
               <ConsignorBusinessUnitType>COM</ConsignorBusinessUnitType>
               <ConsigneeCountry>DE</ConsigneeCountry>
               <ConsigneeState/>
               <ConsigneeBusinessUnitCode>9000</ConsigneeBusinessUnitCode>
               <ConsigneeBusinessUnitType>COM</ConsigneeBusinessUnitType>
               <CarrierCountry/>
               <CarrierState/>
               <CarrierBusinessUnitCode/>
               <CarrierBusinessUnitType/>
               <ShipmentStartCountry/>
               <ShipmentEndCountry/>
               <ShipmentStartState/>
               <ShipmentEndState/>
               <ServiceRenderedCountry/>
               <ServiceRenderedState/>
               <ResalePurpose>Y</ResalePurpose>
               <IsOutBonded>N</IsOutBonded>
               <IsInBonded>N</IsInBonded>
               <TaxPreAlgorithmOutput>
                  <IsExport>Y</IsExport>
                  <IsImport>N</IsImport>
                  <IsExported>N</IsExported>
                  <IsImported>N</IsImported>
               </TaxPreAlgorithmOutput>
               <ShippingOfCustomsClearedGoods>Y</ShippingOfCustomsClearedGoods>
            </VariableTaxSteeringInput>
            <BuyerParty>
               <Party>
                  <BusinessUnitCode>9000</BusinessUnitCode>
                  <BusinessUnitType>COM</BusinessUnitType>
                  <BusinessUnitName/>
                  <PartyAddress>
                     <AddressType>MAIN</AddressType>
                     <City>HOFHEIM-WALLAU</City>
                     <PostBox/>
                     <Street>AM WANDERSMANN 2-4</Street>
                     <ZipCode>65719</ZipCode>
                     <CountryCode>DE</CountryCode>
                     <StateCode/>
                     <CountryOfLegalRegistration>DE</CountryOfLegalRegistration>
                  </PartyAddress>
               </Party>
            </BuyerParty>
            <SellerParty>
               <Party>
                  <BusinessUnitCode>7008</BusinessUnitCode>
                  <BusinessUnitType>COM</BusinessUnitType>
                  <BusinessUnitName/>
                  <PartyAddress>
                     <AddressType>MAIN</AddressType>
                     <City>Telde</City>
                     <PostBox/>
                     <Street>Autopista Las Palmas - Gando Knm 12</Street>
                     <ZipCode>E-352 19</ZipCode>
                     <CountryCode>ES</CountryCode>
                     <StateCode>ESTF</StateCode>
                     <CountryOfLegalRegistration>ES</CountryOfLegalRegistration>
                  </PartyAddress>
               </Party>
            </SellerParty>
            <TermOfDelivery>DDU</TermOfDelivery>
</arg0>
 </ws:applyTax>
</soap:Body>
</soap:Envelope>